package org.example.Tinkoff_QA_Autumn2023;

public class ForthTask { //не ок

}

/*
На Диком западе ходят купюры номиналами a1,a2,…,am долларов. Однажды ковбой Джо решил
ограбить банк. Он выбрал очень неудачный момент для ограбления, ведь сейчас в банке находятся
ровно по две купюры каждого существующего номинала.

Ковбой Джо хочет украсть ровно n долларов, ни долларом больше, ни долларом меньше. Помогите
ему или сообщите, что его план неосуществим.

Формат входных данных
В первой строке даны целые числа n,m (1≤n≤10^9, 1≤m≤10) — необходимая ковбою Джо
сумма и количество номиналов купюр.
Во второй строке вводятся m попарно различных целых чисел a1,a2,…,am (1≤ai≤10^9) —
существующие номиналы купюр.

Формат выходных данных
Если ковбой Джо сможет украсть ровно n долларов, выведите число k — количество украденных
купюр. Затем выведите k целых чисел — номиналы купюр. Если решений несколько, вы можете
вывести любое.

В противном случае выведите −1.
Примеры данных
Пример 1
ввод
5 2
1 2
вывод
3
1 2 2

Пример 2
ввод
7 2
1 2
вывод
-1

Пример 3
ввод
5 2
3 4
вывод
-1
 */
