package org.example.Tinkoff_QA_Autumn2023;

public class ThirdTask { //не ок

}

/*
Перед ковбоем Джо выложены n карт со значениями a1,a2,…,an. Он хочет получить выигрышную
последовательность карт со значениями b1,b2,…,bn.

Ковбой может выбрать непрерывный отрезок карт в своей последовательности [l,r] (1≤l≤r≤n)
и упорядочить карты в этом отрезке по неубыванию. Например, если перед ковбоем лежат карты
{3,3,2,5,1,5}, он может выбрать отрезок [2,5] и получить последовательность {3,1,2,3,5,5}.

Получится ли у ковбоя Джо получить выигрышную последовательность с помощью применения
вышеописанной операции ровно один раз?

Формат входных данных
В первой строке дано целое число n (1≤n≤2⋅10^5) — количество карт в последовательности.
Во второй строке даны n целых чисел a1,a2,…,an (1≤ai≤10^9) — последовательность ковбоя Джо.
В третьей строке даны n целых чисел b1,b2,…,bn (1≤bi≤10^9) — выигрышная последовательность.

Формат выходных данных
Выведите «YES» (без кавычек), если Джо может получить выигрышную последовательность, иначе
выведите «NO».

Примеры данных
Пример 1
ввод
5
1 4 2 2 4
1 4 4 2 2
вывод
NO

Пример 2
ввод
6
5 1 2 5 3 5
5 1 2 3 5 5
вывод
YES

Пример 3
ввод
3
4 1 2
1 4 7
вывод
NO
 */